qa/qa-artifacts/gs/request.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
   <soapenv:Body>
      <p:echoInt xmlns:p="http://echo.services.core.carbon.wso2.org">
         <!--0 to 1 occurrence-->
            <in><p:echoString xmlns:p="http://echo.services.core.carbon.wso2.org">      <in>The WSO2 Gadget Server brings Gadget technology into the enterprise by providing a customized end-user portal that makes it easy for teams to build attractive and effective portals in record time. Built on top of the Google Gadget Specification, the WSO2 Gadget Server allows Google Gadgets to be developed and deployed in a simple, decentralized manner. Any developer with basic web development skills can create a custom gadget easily and many third-party Google Gadgets are available to add to a user?s personalized dashboard.The WSO2 Gadget Server brings Gadget technologyinto the enterprise by providing a customized end-user portal that makes it easy for teams to build attractive and effective portals in record time. Built on top of the Google Gadget Specification, the WSO2 Gadget ServerThe WSO2 Gadget Server brings Gadget technology into the enterprise by providing a customized end-user portal that makes it easy for teams to build attractive and effective portals in record time. Built on top of the Google Gadget Specification, the WSO2 Gadget Server allows Google Gadgets to be developed and deployed in a simple, decentralized manner. Any developer with basic web development skills can create a custom gadget easily and many third-party Google Gadgets are available to add to a user?s personalized dashboard.The WSO2 Gadget Server brings Gadget technologyinto the enterprise by providing a customized end-user portal that makes it easy for teams to build attractive and effective portals in record time. Built on top of the Google Gadget Specification, the WSO2 Gadget Server allowsGoogle Gadgets to be developed and deployed in a simple, decentralized manner. Any developer with basic web development skills can create a custom gadget easily and many third-party Google Gadgets are available to add to a user?spersonalized dashboard.The WSO2 Gadget Server brings Gadget technology into the enterprise by providing a customized end-user portal that makes it easy for teams to build attractive and effective portals in record time. Built on top of the Google Gadget Specification, the WSO2 Gadget Server allows Google Gadgets to be developed and deployed in a simple, decentralized manner. Any developer with basic web development skills can create a custom gadget easily andmany third-party Google Gadgets are available to add to a user?s personalized dashboard.The WSO2 Gadget Server brings Gadget technology into the enterprise by providing a customized end-user portal that makes it easy for teams to build attractive and effective portals in record time. Built on top of the Google Gadget Specification, the WSO2 Gadget Server allows Google Gadgets to be developed and deployed in a simple, decentralized manner. Any developerwith basic web development skills can create a custom gadget easily and many third-party Google Gadgets are available to add to a user?s personalized dashboard.The WSO2 Gadget Server brings Gadget technology into the enterprise by providing a customized end-user portal that makes it easy for teams to build attractive and effective portals in record time. Built on top of the Google Gadget Specification, the WSO2 Gadget Server allows Google Gadgets to bedeveloped and deployed in a simple, decentralized manner. Any developer with basic web development skills can create a custom gadget easily and many third-party Google Gadgets are available to add to a user?s personalizeddashboard.The WSO2 Gadget Server brings Gadget technology into the enterprise by providing a customized end-user portal that makes it easy for teams to build attractive and effective portals in record time. Built on top ofthe Google Gadget Specification, the WSO2 Gadget Server allows Google Gadgets to be developed and deployed in a simple, decentralized manner. Any developer with basic web development skills can create a custom gadgeteasily and many third-party Google Gadgets are available to add to a user?s personalized dashboard.The WSO2 Gadget Server brings Gadget technology into the enterprise by providing a customized end-user portal that makes it easy for teams to build attractive and effective portals in record time. Built on top of the Google Gadget Specification, the WSO2 Gadget Server allows Google Gadgets to be developed and deployed in a simple, decentralized manner. Any developer with basic web development skills can create a custom gadget easily and many third-party Google Gadgets are available to add to a user?s personalized dashboard.The WSO2 Gadget Serverbrings Gadget technology into the enterprise by providing a customized end-user portal that makes it easy for teams to build attractive and effective portals in record time. Built on top of the Google Gadget Specification, the WSO2 Gadget Server allows Google Gadgets to be developed and deployed in a simple, decentralized manner. Any developer with basic web development skills can create a custom gadget easily and many third-party GoogleGadgets are available to add to a user?s personalized dashboard.The WSO2 Gadget Server brings Gadget technology into the enterprise by providing a customized end-user portal that makes it easy for teams to build attractiveand effective portals in record time. Built on top of the Google Gadget Specification, the WSO2 Gadget Server allows Google Gadgets to be developed and deployed in a simple, decentralized manner. Any developer with basic webdevelopment skills can create a custom gadget easily and many third-part Google Gadgets are available to add to a user?s personalized dashboard.The WSO2 Gadget Server brings Gadget technology into the enterprise by providinga customized end-user portal that makes it easy for teams to build attractive and effective portals in record time. Built on top of the Google Gadget Specification, the WSO2 Gadget Server allows Google Gadgets to be developedand deployed in a simple, decentralized manner. Any developer with basic web development skills can create a custom gadget easily and many third-party Google Gadgets are available to add to a user?s personalized dashboard.The WSO2 Gadget Server brings Gadget technology into the enterprise by providing a customized end-user portal that makes it easy for teams to build attractive and effective portals in record time. Built on top of the GoogleGadget Specification, the WSO2 Gadget Server allows Google Gadgets to be developed and deployed in a simple, decentralized manner. Any developer with basic web development skills can create a custom gadget easily and many third-partyGoogle Gadgets are available to add to a user?s personalized dashboard.The WSO2 Gadget Server brings Gadget technology into the enterprise by providing a customized end-user portal that makes it easy for teams to build attractive andeffective portals in record time. Built on top of the Google Gadget Specification, the WSO2 Gadget Server allows Google Gadgets to be developed and deployed in a simple, decentralized manner. Any developer with basic web development skills can create a custom gadget easily and many third-party Google Gadgets are available to add to a user?s personalized dashboard. </in> </p:echoString></in>
         </p:echoInt>
      </soapenv:Body>
   </soapenv:Envelope>
